# Задача 32: Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону (т.е. не
# меньше заданного минимума и не больше заданного
# максимума)
# Ввод: [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 19]
import random
a1 = [random.randint(-30,30) for _ in range(int(input('введите количество элементов массива=')))]
# a1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
b=len(a1)
min = int(input("введите минимальное число диапазона="))
max = int(input("введите максимальное число диапазона="))
print(a1)
print([i for i in range(len(a1)) if min <= a1[i] and a1[i] <= max])
# for i in range(len(a1)):
#     if min <= a1[i] and a1[i] <= max:
#         print(i)